'use client';

import { Paper, Space, Text, Title } from '@mantine/core';

export const Description = () => {
  return (
    <Paper>
      <Title order={2}>お母さんヒス構文とは?</Title>
      <Text>
        お母さんヒス構文とは、お母さんがヒステリックな口調で話を飛躍させたり、論点をすり替えたりして、相手に罪悪感を抱かせるような構文のことです。
      </Text>
      <Text>お笑い芸人のラランドさんがGERAのラジオ放送(第100回)で紹介したことが始まりです。</Text>
      <Text>
        お母さんヒス構文は感情を表現するために使われることがありますが、相手に対して威圧的な印象を与えることもあるので、注意が必要です。
        建設的なコミュニケーションを心がけましょう。
      </Text>
      <Space h='md' />
      <Title order={2}>お母さんヒス構文メーカーについて</Title>
      <Text>
        お母さんヒス構文メーカーは、ヒス家庭を疑似体験できる目的で作成されたアプリです。AIのヒスお母さんとチャットすることができます。
      </Text>
      <Text>
        お母さんヒス構文メーカーは、おもしろいだけでなく、お母さんヒス構文のパターンを学ぶことで、実際に遭遇したときに対処する力を養うことができます。
        ただし、お母さんヒス構文メーカーはあくまでジョークのツールであり、実際にお母さんに使うと大変なことになりますので、ご注意ください。
      </Text>
    </Paper>
  );
};
